//===========================================================================
//
//
//███╗   ███╗ █████╗ ██████╗ ██╗ ██████╗ ██████╗ ██████╗  ██████╗ ███╗   ███╗
//████╗ ████║██╔══██╗██╔══██╗██║██╔═══██╗██╔══██╗██╔══██╗██╔═══██╗████╗ ████║
//██╔████╔██║███████║██████╔╝██║██║   ██║██████╔╝██████╔╝██║   ██║██╔████╔██║
//██║╚██╔╝██║██╔══██║██╔══██╗██║██║   ██║██╔══██╗██╔══██╗██║   ██║██║╚██╔╝██║
//██║ ╚═╝ ██║██║  ██║██║  ██║██║╚██████╔╝██║  ██║██║  ██║╚██████╔╝██║ ╚═╝ ██║
//╚═╝     ╚═╝╚═╝  ╚═╝╚═╝  ╚═╝╚═╝ ╚═════╝ ╚═╝  ╚═╝ ╚═╝ ╚═╝ ╚═════╝ ╚═╝     ╚═╝
//                          MarioRRom's Aetheris Shell
//                 https://github.com/MarioRRom/aetheris-shell
//===========================================================================


//  .-------------------------.
//  | .---------------------. |
//  | |   Import Modules    | |
//  | `---------------------' |
//  `-------------------------'

// Quickshell
import QtQuick
import QtMultimedia

Item {

    property var sourceWallpaper: "../../assets/wallpapers/paimon.png"
    property bool isVideoWallpaper: false

    Image {
        id: wallpaper
        anchors.fill: parent
        visible: !isVideoWallpaper
        cache: false
        smooth: false
        fillMode: Image.PreserveAspectCrop

        // Wallpaper Path
        source: sourceWallpaper
    }

    Video {
        id: wallpaperVideo
        anchors.fill: parent
        visible: isVideoWallpaper
        autoPlay: isVideoWallpaper
        loops: MediaPlayer.Infinite
        fillMode: VideoOutput.PreserveAspectCrop

        // Wallpaper Path
        source: sourceWallpaper
    }
}